; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v2 - type_2 ?v1 - type_1)
 	      (pred_4 ?v7 - object ?v1 - type_1)
	      (pred_3 ?v2 - type_2 ?v3 - type_3)
	      (pred_2 ?v2 - type_2 ?v7 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v2 - type_2 ?v8 ?v6 - type_1)
       :precondition (and  (pred_1 ?v2 ?v8))
       :effect (and  (pred_1 ?v2 ?v6)
		     (not (pred_1 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_2 ?v5 - object ?v4 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v4) (pred_1 ?v2 ?v4) (pred_3 ?v2 ?v3))
       :effect (and (pred_2 ?v2 ?v5 ?v3)
		    (not (pred_4 ?v5 ?v4)) 
		    (not (pred_3 ?v2 ?v3))))

   (:action op_1
       :parameters (?v2 - type_2 ?v5 - object ?v4 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v5 ?v3) (pred_1 ?v2 ?v4))
       :effect (and (pred_4 ?v5 ?v4)
		    (pred_3 ?v2 ?v3)
		    (not (pred_2 ?v2 ?v5 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_04 obj_06 - type_3
obj_03 obj_01 obj_07 - type_1
obj_08 obj_09 obj_05 - object)
(:init
(pred_1 obj_02 obj_01)
(pred_3 obj_02 obj_04)
(pred_3 obj_02 obj_06)
(pred_4 obj_08 obj_01)
(pred_4 obj_09 obj_01)
(pred_4 obj_05 obj_03)
)
(:goal
(and
(pred_4 obj_08 obj_01)
(pred_4 obj_09 obj_01)
(pred_4 obj_05 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_02 ?b obj_06))))
)
)

; plan
1. (op_3 obj_02 obj_01 obj_03)
   deleted: (pred_1 obj_02 obj_01)
   added: (pred_1 obj_02 obj_03)
   goals met: 2 of 3
2. (op_2 obj_02 obj_05 obj_03 obj_04)
   deleted: (pred_4 obj_05 obj_03) (pred_3 obj_02 obj_04)
   added: (pred_2 obj_02 obj_05 obj_04)
   goals met: 2 of 3
3. (op_3 obj_02 obj_03 obj_01)
   deleted: (pred_1 obj_02 obj_03)
   added: (pred_1 obj_02 obj_01)
   goals met: 2 of 3
4. (op_1 obj_02 obj_05 obj_01 obj_04)
   deleted: (pred_2 obj_02 obj_05 obj_04)
   added: (pred_4 obj_05 obj_01) (pred_3 obj_02 obj_04)
   goals met: 3 of 3
